let mass = materialize (union AADNonInteractiveUserSignInLogs, SigninLogs  
| project AppDisplayName, ConditionalAccessStatus, TimeGenerated, ClientAppUsed, UserAgent
| where isnotempty( ClientAppUsed)
|  where TimeGenerated > now() -90d);
mass
| extend filterResult = case("Total" == "Total", "", "Total" == "Success", "success", "Total" == "Failure", "failure", "notApplied")
| where ConditionalAccessStatus has filterResult
| summarize make_set(ConditionalAccessStatus) by AppDisplayName, ClientAppUsed
| extend results = array_length(set_ConditionalAccessStatus)
| where results == 1 and set_ConditionalAccessStatus has "notApplied"